app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (title LIKE '%Test 2%')
SELECT "articles".* FROM "articles"
---
  def index
    if params[:query].present?
      @query = params[:query]
      @articles = Article.where("title LIKE ?", "%#{@query}%")
    else
      @articles = Article.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @article = current_user.articles.build(article_params)
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "This is the body of the article. The goal of this article is to test permissions. The Admin was here"], ["updated_at", "2023-07-06 12:35:14.161586"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    authorize_edit(@article)

    if @article.update(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
DELETE FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
---
  def destroy
    @article = Article.find(params[:id])

    begin
      ActiveRecord::Base.transaction do
        puts "Deleting comments..."
        @article.comments.delete_all # Delete all comments associated with the article

        puts "Deleting article..."
        @article.destroy! # Delete the article