app/controllers/articles_controller.rb

  def create
    @article = current_user.articles.build(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @article = current_user.articles.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

  def update
    @article = current_user.articles.find(params[:id])
    if @article.update(article_params)
---
UPDATE "articles" SET "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["updated_at", "2023-07-03 16:57:10.050546"], ["status", "public"], ["id", 5]]

  def destroy
    @article = current_user.articles.find(params[:id])
    @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]