app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "article_id", "created_at", "updated_at", "status", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["body", "Test Comment for Delete 2"], ["article_id", 1], ["created_at", "2023-07-06 23:52:26.980380"], ["updated_at", "2023-07-06 23:52:26.980380"], ["status", "public"], ["user_id", 2]]

  def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])


    if @comment.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 2], ["id", 2], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]