app/models/user_profile.rb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
---
  def post_count
    user.articles.count